v13/advection-diffusion/advection-diffusion-2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          functions;

subSolver       incompressibleFluid;

startFrom       latestTime;

startTime       0;

subSolverTime   0;

stopAt          endTime;

endTime         4;

deltaT          0.001;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// writeControl    timeStep;

// writeInterval   400;

writeControl    runTime; // adjustableRunTime

writeInterval   1;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

purgeWrite      0;

writeFormat     binary; //ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //
