v13/advection-diffusion/advection-diffusion-2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

Lx      10;
yMin   -2;
yMax    2;

xCells  30;
yCells  30;

vertices
(
    (0      $yMin   -0.5)
    ($Lx    $yMin   -0.5)
    ($Lx    $yMax   -0.5)
    (0      $yMax   -0.5)
    (0      $yMin    0.5)
    ($Lx    $yMin    0.5)
    ($Lx    $yMax    0.5)
    (0      $yMax    0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (#calc "$xCells * $Lx" #calc "$yCells * round(mag($yMax - $yMin))" 1) simpleGrading (1 1 1)
);

boundary
(
    left
    {
        // type wall;
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    top
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
